src/Test 39 Request.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Header><a:Action s:mustUnderstand="1">urn:ihe:iti:2007:ProvideAndRegisterDocumentSet-b</a:Action><h:PCEHRHeader xmlns="http://ns.electronichealth.net.au/pcehr/xsd/common/CommonCoreElements/1.0" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:h="http://ns.electronichealth.net.au/pcehr/xsd/common/CommonCoreElements/1.0" xml:id="header-8bf1a815-233a-4218-af04-29d92016c0db"><User><IDType>HPII</IDType><ID>8003611566713495</ID><userName>Mr Philip James Farman II</userName><useRoleForAudit>false</useRoleForAudit></User><ihiNumber>8003608666976659</ihiNumber><productType><vendor>StrongRoom AI</vendor><productName>StrongCare</productName><productVersion>1.0</productVersion><platform>CSP</platform></productType><clientSystemType>CSP</clientSystemType><accessingOrganisation><organisationID>8003623233372670</organisationID><organisationName>Strong Room</organisationName></accessingOrganisation></h:PCEHRHeader><h:signature xmlns="http://ns.electronichealth.net.au/pcehr/xsd/common/CommonCoreElements/1.0" xmlns:h="http://ns.electronichealth.net.au/pcehr/xsd/common/CommonCoreElements/1.0"><Signature xmlns="http://www.w3.org/2000/09/xmldsig#"><SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><Reference URI="#body-d9a06883-8a31-42d7-8680-8a91147fa58a"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><DigestValue>gXXyVPI7YrYo6Y4jRnxng1sc6Sw=</DigestValue></Reference><Reference URI="#header-8bf1a815-233a-4218-af04-29d92016c0db"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><DigestValue>ObXBDGo/Ccn7oXPqdBYlous7+oA=</DigestValue></Reference><Reference URI="#timestamp-4eeae5a4-1c10-4490-bf9e-914508dc640a"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><DigestValue>MhJ+c+h0viXVp2qh4T155m+n1SI=</DigestValue></Reference></SignedInfo><SignatureValue>NWeVYpD4cqXutmhZ+h8X2k0orRDeOCRco8kdJgF++AveSkL3171nMQ1cdnsC5uJUg007b1KqE9lMxTL4JLwUIn83WdyRAiIhDKi9fvVMiegE7zd29holbyGLHJaEkHk/DDUx37xr4fSY9SgMDrYKaecgZ7BTP8AwDZEVOOvcCuEZNUSeIE8RDO6I2T6zVb39N758JqIhnRBI5JHo9kokeHwEScZWqiyrRyKvXoHneDmj/U/nV8igV0O0Dlbs6JN1AX6ZplNy98hvhHIwWJb389uy8pwPGBd+/Ziq5PSc39rmZq+rEQJDTjmIYGp/KnQ4L6QkIFUCLkv0VTn+N7IiRg==</SignatureValue><KeyInfo><X509Data><X509Certificate>MIIGkDCCBXigAwIBAgICOyQwDQYJKoZIhvcNAQELBQAwejELMAkGA1UEBhMCQVUxDDAKBgNVBAoTA0dPVjEWMBQGA1UECxMNSHVtYW5zZXJ2aWNlczFFMEMGA1UEAxM8VGVzdCBNZWRpY2FyZSBBdXN0cmFsaWEgT3JnYW5pc2F0aW9uIENlcnRpZmljYXRpb24gQXV0aG9yaXR5MB4XDTIzMDgyODAxMjIwN1oXDTI1MDgyODAxMjIwN1owgdIxEjAQBgoJkiaJk/IsZAEZFgJhdTETMBEGCgmSJomT8ixkARkWA25ldDEgMB4GCgmSJomT8ixkARkWEGVsZWN0cm9uaWNoZWFsdGgxEjAQBgoJkiaJk/IsZAEZFgJpZDEgMB4GCgmSJomT8ixkARkWEDgwMDM2MzMyMzMzNjkxNzAxETAPBgNVBAoTCENTUDEwMzMxMTwwOgYDVQQDEzNnZW5lcmFsLjgwMDM2MzMyMzMzNjkxNzAuaWQuZWxlY3Ryb25pY2hlYWx0aC5uZXQuYXUwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQDLFvV7W5/zH/VEcYNGDCJQM0ZFwOIioDCaSb4tteJIRw9ag12HLogFozYXpJ/c87JlM9x7Xms4sPp9RH5Ln5nZ/H4V2bcH8AurquEoZG2sVJLMltCLvhgkw0ZhDNe02KSrGUqLSlFvtRswyMSe3CCRRGUJiNlmpkphVTs7ZEx8EZU1036BjK3kMktEy5a1HfyoUrXVApZ4W2SpiUKl4pNU7kSXSAD375WyHmdHKbLOU3zvVnfiNBY6+mAJLEwUIF+uQf1jP0+fqWoUrWGEu0c0UzHSNi4iEYotZ4WQkj93tW1jE1Nh6f9LGX1ZeC2qH6V01L5FWoEhAfDTVM8pz/zTAgMBAAGjggLFMIICwTAMBgNVHRMBAf8EAjAAME8GCCsGAQUFBwEBBEMwQTA/BggrBgEFBQcwAYYzaHR0cDovL29jc3AuY2VydGlmaWNhdGVzLWF1c3RyYWxpYS5jb20uYXUvbWFvY2EucGt4MIIBHAYDVR0gBIIBEzCCAQ8wggELBgoqJNL+gHcBFgEBMIH8MIHLBggrBgEFBQcCAjCBvhqBu0NlcnRpZmljYXRlcyBpc3N1ZWQgdW5kZXIgdGhpcyBDUCBtdXN0IG9ubHkgYmUgcmVsaWVkIG9uIGJ5IGVudGl0aWVzIHdpdGhpbiB0aGUgQ29tbXVuaXR5IG9mIEludGVyZXN0LCB1bmxlc3Mgb3RoZXJ3aXNlIGFncmVlZCwgYW5kIG5vdCBmb3IgcHVycG9zZXMgb3RoZXIgdGhhbiB0aG9zZSBwZXJtaXR0ZWQgYnkgdGhpcyBDUC4wLAYIKwYBBQUHAgEWIGh0dHA6Ly93d3cuaHVtYW5zZXJ2aWNlcy5nb3YuYXUvMBkGCSoko5CVFwHOGQQMFgo5MTg1MjgzNTk2MA4GA1UdDwEB/wQEAwIEsDATBgNVHSUEDDAKBggrBgEFBQcDAjCBnAYDVR0jBIGUMIGRgBSvYN51YctPajChNpNGTWUzAIit7qF2pHQwcjELMAkGA1UEBhMCQVUxDDAKBgNVBAoTA0dPVjEWMBQGA1UECxMNSHVtYW5zZXJ2aWNlczE9MDsGA1UEAxM0VGVzdCBNZWRpY2FyZSBBdXN0cmFsaWEgUm9vdCBDZXJ0aWZpY2F0aW9uIEF1dGhvcml0eYIBBDBOBgNVHR8ERzBFMEOgQaA/hj1odHRwOi8vbWF0ZXN0LmNlcnRpZmljYXRlcy1hdXN0cmFsaWEuY29tLmF1L01BT0NBMi9sYXRlc3QuY3JsMBEGA1UdDgQKBAhA1qgYBrJOrjANBgkqhkiG9w0BAQsFAAOCAQEAyojZ9t1wy3u0Z1SgkwPesMuaPKxibVoSHZ9GyffnBfu76Ed6/7UJUmUBF/pReEa8vDysGZuR5V9AaiGmXQNMmGOq+HsMlbOy6TEUb/LKJeIBfPgXPKsUKqdw0pSOM66emmbIypQTZVthiVQAIa6NEpq/dbFSusgrWO0EhwrvsBo/QjxazfcX2qpCLzDCKYy2kGpLamVHHxsonC6WNWEmG4ib2cwDfcvjX4mGWZag6ZBed9/1RKsKCmylFs2mv3CX/7VZ25y90bbe5nmqem6gGh41/aHL4qG86NEqPseHtfjKmylY0K42Oe7ul8bVxX9+9m2DXqlfb9Dlq26U39Qb8Q==</X509Certificate></X509Data></KeyInfo></Signature></h:signature><h:timestamp xmlns="http://ns.electronichealth.net.au/pcehr/xsd/common/CommonCoreElements/1.0" xmlns:h="http://ns.electronichealth.net.au/pcehr/xsd/common/CommonCoreElements/1.0" xml:id="timestamp-4eeae5a4-1c10-4490-bf9e-914508dc640a"><created>2024-04-16T14:43:21+10:00</created></h:timestamp><a:MessageID>urn:uuid:a4c636ca-690e-486a-9dd8-42fe1396bed4</a:MessageID><a:ReplyTo><a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address></a:ReplyTo><a:From><a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address></a:From><a:To s:mustUnderstand="1">http://www.w3.org/2005/08/addressing/anonymous</a:To></s:Header><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xml:id="body-d9a06883-8a31-42d7-8680-8a91147fa58a"><ProvideAndRegisterDocumentSetRequest xmlns="urn:ihe:iti:xds-b:2007"><SubmitObjectsRequest xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0"><RegistryObjectList xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0"><ExtrinsicObject id="DOCUMENT_SYMBOLICID_01" mimeType="application/zip" objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1" status="urn:oasis:names:tc:ebxml-regrep:StatusType:Approved"><Slot name="creationTime"><ValueList><Value>20240313053310</Value></ValueList></Slot><Slot name="languageCode"><ValueList><Value>en-AU</Value></ValueList></Slot><Slot name="serviceStartTime"><ValueList><Value>20200611013225</Value></ValueList></Slot><Slot name="serviceStopTime"><ValueList><Value>20240313053310</Value></ValueList></Slot><Slot name="sourcePatientId"><ValueList><Value>8003608666701594^^^&amp;1.2.36.1.2001.1003.0&amp;ISO</Value></ValueList></Slot><Name><LocalizedString value="undefined"/></Name><Classification classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" classifiedObject="DOCUMENT_SYMBOLICID_01" id="cl06" nodeRepresentation="" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"><Slot name="authorInstitution"><ValueList><Value>MEDTESTORGSB120^^^^^^^^^1.2.36.1.2001.1003.0.8003629900019338</Value></ValueList></Slot><Slot name="authorPerson"><ValueList><Value>^Jones^^^^Sir^^^&amp;1.2.36.1.2001.1003.0.8003615833334118&amp;ISO</Value></ValueList></Slot><Slot name="authorSpecialty"><ValueList><Value>General Medical Practitioner</Value></ValueList></Slot></Classification><Classification classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a" classifiedObject="DOCUMENT_SYMBOLICID_01" id="cl07" nodeRepresentation="34133-9" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"><Slot name="codingScheme"><ValueList><Value>undefined</Value></ValueList></Slot><Name><LocalizedString value="Event Summary"/></Name></Classification><Classification classificationScheme="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f" classifiedObject="DOCUMENT_SYMBOLICID_01" id="cl08" nodeRepresentation="GENERAL" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"><Slot name="codingScheme"><ValueList><Value>PCEHR_DocAccessLevels</Value></ValueList></Slot><Name><LocalizedString value="NA"/></Name></Classification><Classification classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d" classifiedObject="DOCUMENT_SYMBOLICID_01" id="cl09" nodeRepresentation="undefined" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"><Slot name="codingScheme"><ValueList><Value>PCEHR_FormatCodes</Value></ValueList></Slot><Name><LocalizedString value="333"/></Name></Classification><Classification classificationScheme="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1" classifiedObject="DOCUMENT_SYMBOLICID_01" id="cl10" nodeRepresentation="8511" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"><Slot name="codingScheme"><ValueList><Value>ANZSIC</Value></ValueList></Slot><Name><LocalizedString value="General Practice"/></Name></Classification><Classification classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead" classifiedObject="DOCUMENT_SYMBOLICID_01" id="cl11" nodeRepresentation="8511-3" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"><Slot name="codingScheme"><ValueList><Value>ANZSIC</Value></ValueList></Slot><Name><LocalizedString value="General practice medical clinic service"/></Name></Classification><Classification classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983" classifiedObject="DOCUMENT_SYMBOLICID_01" id="cl12" nodeRepresentation="34133-9" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"><Slot name="codingScheme"><ValueList><Value>undefined</Value></ValueList></Slot><Name><LocalizedString value="Event Summary"/></Name></Classification><ExternalIdentifier id="ei13" identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="SUBSET_SYMBOLICID_01" value="8003608666701594^^^&amp;1.2.36.1.2001.1003.0&amp;ISO"><Name><LocalizedString value="XDSDocumentEntry.patientId"/></Name></ExternalIdentifier><ExternalIdentifier id="ei14" identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="SUBSET_SYMBOLICID_01" value="1.2.36.3253193630.51542.18960.38486.113960358484453"><Name><LocalizedString value="XDSDocumentEntry.uniqueId"/></Name></ExternalIdentifier></ExtrinsicObject><RegistryPackage id="SUBSET_SYMBOLICID_01" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:RegistryPackage"><Slot name="submissionTime"><ValueList><Value>20240416144321</Value></ValueList></Slot><Name><LocalizedString value="undefined"/></Name><Classification classificationScheme="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e12d" classifiedObject="SUBSET_SYMBOLICID_01" id="cl02" nodeRepresentation="" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"><Slot name="authorInstitution"><ValueList><Value>MEDTESTORGSB120^^^^^^^^^1.2.36.1.2001.1003.0.8003629900019338</Value></ValueList></Slot><Slot name="authorPerson"><ValueList><Value>^Jones^^^^Sir^^^&amp;1.2.36.1.2001.1003.0.8003615833334118&amp;ISO</Value></ValueList></Slot><Slot name="authorSpecialty"><ValueList><Value>General Medical Practitioner</Value></ValueList></Slot></Classification><Classification classificationScheme="urn:uuid:aa543740-bdda-424e-8c96-df4873be8500" classifiedObject="SUBSET_SYMBOLICID_01" id="cl03" nodeRepresentation="34133-9" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"><Slot name="codingScheme"><ValueList><Value>undefined</Value></ValueList></Slot><Name><LocalizedString value="Event Summary"/></Name></Classification><ExternalIdentifier id="ei4" identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="SUBSET_SYMBOLICID_01" value="1.2.36.3253193630.51542.18960.38486.113960358484453"><Name><LocalizedString value="XDSSubmissionSet.uniqueId"/></Name></ExternalIdentifier><ExternalIdentifier id="ei5" identificationScheme="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="SUBSET_SYMBOLICID_01" value="1.2.36.1.2001.1003.0.8003629900019338"><Name><LocalizedString value="XDSSubmissionSet.sourceId"/></Name></ExternalIdentifier><ExternalIdentifier id="ei6" identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="SUBSET_SYMBOLICID_01" value="8003608666701594^^^&amp;1.2.36.1.2001.1003.0&amp;ISO"><Name><LocalizedString value="XDSSubmissionSet.patientId"/></Name></ExternalIdentifier></RegistryPackage><Classification classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd" classifiedObject="SUBSET_SYMBOLICID_01" id="cl10" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"/><Association associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember" id="as01" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Association" sourceObject="SUBSET_SYMBOLICID_01" targetObject="DOCUMENT_SYMBOLICID_01"><Slot name="SubmissionSetStatus"><ValueList><Value>Original</Value></ValueList></Slot></Association></RegistryObjectList></SubmitObjectsRequest><Document id="DOCUMENT_SYMBOLICID_01">TEE=</Document></ProvideAndRegisterDocumentSetRequest></s:Body></s:Envelope>